app/controllers/gnotes_controller.rb

  def index
    @gnotes = Gnote.paginate :page=>params[:page]||1, :per_page=>12,:order=>"created_at DESC"
---
SELECT * FROM `gnotes` ORDER BY created_at DESC LIMIT 0, 12