app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM `items` WHERE (`items`.`id` = 50)

  def new
    @item = Item.new
		@item.project_id = params[:project_id]
		@projects = Project.all
---
SELECT * FROM `projects` WHERE (`projects`.parent_id = 1)

  def edit
    @item = Item.find(params[:id])

		@projects = Project.all
---
SELECT * FROM `items` WHERE (`items`.`id` = 29)
SELECT * FROM `projects` WHERE (`projects`.parent_id = 1)

  def create
    @item = Item.new(params[:item])


    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`metadesc`, `image_url`, `is_html`, `project_id`, `is_recyle`, `file_path`, `updated_at`, `title`, `is_vote`, `is_list_top`, `tags`, `property`, `info`, `digg_count`, `typo`, `author`, `is_use_templet`, `is_lock`, `stitle`, `is_image`, `is_display`, `sort_id`, `templet`, `metakeywords`, `source`, `image_id`, `visit_count`, `title_style`, `is_comment`, `created_at`) VALUES('亚美经济文化', NULL, 0, 1, 0, NULL, '2009-12-26 05:27:45', 'setef', 0, 0, NULL, '0,0,0,0,0,0,0,0', '<p>&nbsp;sefefsef</p>', 0, 0, '', 0, 0, '', 0, 1, 0, NULL, '亚美经济文化', '', NULL, 0, '', 0, '2009-12-26 05:27:45')