app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (`projects`.parent_id = 1)
---
  def index
    @projects = Project.all

SELECT * FROM `projects` WHERE (`projects`.parent_id = 1)
---
  def show
    @project = Project.find(params[:id])