app/controllers/signs_controller.rb

  def index
    @signs = Sign.all
---
SELECT * FROM `signs`