app/controllers/sites_controller.rb

SELECT * FROM `sites` WHERE (`sites`.`id` = 0)
---
  def show
    @site = Site.find(params[:id])