app/controllers/welcome_controller.rb

SELECT * FROM `projects` WHERE (cn_name like '留学指南') ORDER BY created_at DESC LIMIT 1
---
  def load_projects
    @projects = Project.all